# RebarTooShortImperial Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..RebarTooShortImperial Property
BuiltInFailures..::..RebarFailures Class See Also
---
The minimum length of rebar shape is 1 inch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RebarTooShortImperial { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarTooShortImperial As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RebarTooShortImperial {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace